#include <iostream> // Подключаем библиотеку для ввода-вывода
using namespace std;

#define MAX(a, b) ((a) > (b) ? (a) : (b)) // Определяем макрос для нахождения максимального значения

int main ( )
{
    
    int x = 10; // Объявляем переменную x и присваиваем ей значение 10
    int y = 20; // Объявляем переменную y и присваиваем ей значение 20

    cout << "Максимальное значение: " << MAX ( x, y ) << endl; // Выводим максимальное значение между x и y

    return 0; // Возвращаем 0, чтобы указать на успешное завершение программы
}
