#include <iostream> // Подключаем библиотеку для ввода-вывода
using namespace std;

int main ( )
{
 
    int a = 10; // Объявляем целочисленную переменную a и присваиваем ей значение 10
    float b = a; // Неявное преобразование int в float
    cout << "Неявное: " << b << endl; // Выводим значение b

    float c = 5.75; // Объявляем переменную c типа float и присваиваем ей значение 5.75
    int d = (int)c; // Явное преобразование float в int, потеря дробной части
    cout << "Явное: " << d << endl; // Выводим значение d

    return 0; // Возвращаем 0, чтобы указать на успешное завершение программы
}
