#include <iostream> // Подключаем библиотеку для ввода-вывода
using namespace std;

#define PI 3.14 // Определяем константу PI
#define SQUARE(x) ((x) * (x)) // Определяем макрос для вычисления квадрата числа

int main ( )
{
    cout << "PI: " << PI << endl; // Выводим значение PI
    int num = 5; // Объявляем переменную num и присваиваем ей значение 5
    cout << "Квадрат числа " << num << ": " << SQUARE ( num ) << endl; // Выводим квадрат числа num

    return 0; // Возвращаем 0, чтобы указать на успешное завершение программы
}
